In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.random(size=(5,3))

df = pd.DataFrame(data= data, columns =["A", "B", "C"])

print(df)

          A         B         C
0  0.369706  0.278622  0.358002
1  0.435022  0.097770  0.196585
2  0.293061  0.838440  0.939775
3  0.497290  0.424345  0.762394
4  0.784480  0.879940  0.695034

In [3]:
df1= pd.DataFrame(data= {"A": [1,2,3], "B": [4,5,6], "C": [7,8,9]})

df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [4]:
df2= pd.DataFrame(data= {"A": [1,2,3], "B": ["sam", "alex", "John"]})
df2

   A     B
0  1   sam
1  2  alex
2  3  John

In [5]:
df3 = pd.DataFrame(np.random.random(size = (10000, 4)), columns = ["A", "B", "C", "D"])
df3

             A         B         C         D
0     0.279609  0.892122  0.425740  0.992260
1     0.318772  0.397066  0.202017  0.543481
2     0.412690  0.125504  0.415564  0.476853
3     0.598996  0.912784  0.870356  0.785710
4     0.335756  0.135186  0.668986  0.507138
...        ...       ...       ...       ...
9995  0.987048  0.833316  0.104966  0.220444
9996  0.624469  0.191125  0.397109  0.656779
9997  0.329389  0.263369  0.570630  0.556866
9998  0.059441  0.119892  0.422470  0.971514
9999  0.670991  0.069698  0.661304  0.455410

[10000 rows x 4 columns]

In [6]:
df3.to_csv("random_numbers.csv", index=False, float_format="%0.4f")

In [8]:
# Your code goes here. Create a dataframe matching the above diagram and assign it to the variable fruit_sales.
fruit_sales = pd.DataFrame(data= {"Apples": [35,41], "Bananas": [21, 34]}, index = (["2017 Sales", "2018 Sales"]))
# Check your answer
fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34